/*
Ваша задача - создать простую систему управления библиотекой на C++. 
Система должна позволять добавлять новые книги в библиотеку, брать книги взаймы, 
возвращать книги и выводить список всех книг в библиотеке. 
Также система должна сохранять состояние библиотеки между запусками программы, 
сохраняя и загружая данные о книгах в файл и из файла. Например, 
если пользователь попытается взять взаймы книгу, которая уже кем-то взята, 
система должна сообщить ему об этом. Когда книга возвращается, 
система должна позволить пользователю взять её взаймы. Вам следует создать разные классы, 
например класс для библиотеки и класс для книги, а также использовать вектор.
*/